*> 見出し部
IDENTIFICATION DIVISION.
 *> プログラム名
 PROGRAM-ID. SAMPLE-01.

*> 環境部
ENVIRONMENT DIVISION.

*> データ部
DATA DIVISION.
*> 変数定義セクション
 WORKING-STORAGE SECTION.
 *>　配列
  01 USERS.
     03 USER OCCURS 5 PIC x(10).
*> 手続き部
PROCEDURE DIVISION.
MAIN.
MOVE "田中" TO USER(1).
MOVE "遠藤" TO USER(2).
MOVE "松本" TO USER(3).
MOVE "浜田" TO USER(4).
MOVE "山崎" TO USER(5).

DISPLAY  USERS UPON  CONSOLE.
DISPLAY  USER(2) UPON  CONSOLE.
STOP RUN.


